# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

S = int(input('Журавлики: '))
Petya = S//4
Sereja = S // 4
Katya = S // 2
print(f'Petya={Petya} и Seryeja={Sereja}, \nKatya={Katya}')
print(f'Вместо они сделали {S} журавликов ))')
